############################################
## 이성종 배경민의 웹 커뮤니티 구축 프로젝트 ## 
############################################

## 로드맵 
1. 개발 환경 조성
    - VSCode 설치
    - Chrome 설치
    - 파일 공유 시스템 구축
        - Git 같은 레포지토리 활용해서 코드 커밋
        - 파일 공유가 가능한 SMB 형태의 시스템 구축


2. VSCODE, Git 학습


3. HTML / CSS 개발 공부
    - Youtube나 인강을 통해 개인 학습
        - 개념 / 이론

4. Yahoo.co.kr 구현 해보기
    - 현재 야후 사이트 동일하게 구현
    - 웹 소스 확인
        - 참조

5. 실제 웹 작성
    - 로컬로 테스트
    - 중간정도 작성 완료시 구름 활용해서 웹서버에 띄우기
    - 성능 테스트
    - 도메인 바인딩

6. 상품성 생기면 실제 서비스 여부 판단
    - 서비스 지속 가능성 확인
    - 서비스 비용 확인
    - 유지보수 내용 협의




웹 서버
    - 오픈소스

코드
    - 깃 활용


AWS, AZure 서버 구매 (구독)





$dltjdwhd = 1
$qorudals = 1

if ($dltjdwhd -eq $qorudals) {
    Write-Host "이성종과 배경민은 같습니다 !"
} else {
    Write-Host "이성종과 배경민은 다릅니다 !"
}




function is_dltjdwhd (

    $dltjdwhd = 4

    if ( $dltjdwhd -ne 4 ) {
        Write-Host " 이성종은 4가 아니다 "
    }
)


# 성종아 화이팅



v1